#Задача:
#Создать калькулятор для работы с рациональными и комплексными числами, организовать меню,
#добавив в неё систему логирования.
#В рамках этого обсуждения вам надо нарисовать “архитектуру” (например, в виде блок-схемы)
#для работы данного приложения.
#Эта задача командная, поэтому вам нужна команда из пяти человек.
#https://docs.google.com/document/d/1VKh9jCPtGvgXf4KdX_Ka_sHbRQPoNxRcJyZEz1B5yTc/edit#heading=h.xoczzmbrh7nr
#На случай, если вы не были на семинаре и находитесь без команды, то проверяйте ссылку выше. 
#Для лучшего понимания, что должно быть у вас в итоге, смотрите запись семинара и презентацию, 
#которая находится в обсуждениях.
#Блок-схема архитектуры проекта обязательна.
#При отправке дз отправляйте готовую версию проекта и укажите свою роль в ней.
#Выжмите максимум из своей роли. Не забывайте про docstring в функциях.